soap-issue/example.xml

<ns0:Envelope
	xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:ns1="http://myapi.ppl.cz/v1">
	<ns0:Header />
	<ns0:Body>
		<ns1:CreatePackages>
			<ns1:Auth>
				<ns1:AuthToken>eyJhbGciOiJSUzI1NiIsInR5cCIgOiAiSldUIiwia2lkIiA6ICJiN19YUXZWZ2dDWDg1YXcwYV9XV3ZCa1pXOXNmaC13MkF1UkNYS0t6M1lzIn0.eyJleHAiOjE2NzI0NzkzODgsImlhdCI6MTY3MjQ3NzU4OCwianRpIjoiMjYwZTNhNDYtMTYxNi00MjljLThiOTQtN2VkNDZkYzJhODZlIiwiaXNzIjoiaHR0cHM6Ly9hdXRoc2VydmljZS1wcm9kLnBwbC5jei9hdXRoL3JlYWxtcy9ydG1fY3pfbXlhcGkiLCJhdWQiOiJhY2NvdW50Iiwic3ViIjoiNjBiNmY5YjktYWQzMC00YjAxLWFhYWUtYzIxNTU4ODI2OTlhIiwidHlwIjoiQmVhcmVyIiwiYXpwIjoiTXlBcGlDbGllbnQiLCJzZXNzaW9uX3N0YXRlIjoiYmFlOTJhMGQtY2U0NS00YWUyLWI4YzItNDFhNDhhMTJlNWRjIiwiYWNyIjoiMSIsInJlYWxtX2FjY2VzcyI6eyJyb2xlcyI6WyJkZWZhdWx0LXJvbGVzLXJ0bV9jel9teWFwaSIsIm9mZmxpbmVfYWNjZXNzIiwidW1hX2F1dGhvcml6YXRpb24iLCJteWFwaS51c2VyIl19LCJyZXNvdXJjZV9hY2Nlc3MiOnsiYWNjb3VudCI6eyJyb2xlcyI6WyJtYW5hZ2UtYWNjb3VudCIsIm1hbmFnZS1hY2NvdW50LWxpbmtzIiwidmlldy1wcm9maWxlIl19fSwic2NvcGUiOiJwcm9maWxlIGVtYWlsIiwic2lkIjoiYmFlOTJhMGQtY2U0NS00YWUyLWI4YzItNDFhNDhhMTJlNWRjIiwiZW1haWxfdmVyaWZpZWQiOnRydWUsImVwcyI6eyJkZXBvdCI6eyJpZCI6MTN9LCJjdXN0b21lciI6eyJpZCI6MjA1MDkzN319LCJwcmVmZXJyZWRfdXNlcm5hbWUiOiJoZGs1NTg3NDUifQ.CuujJYA7NpAU5WyAFecPCs3k1n16FikVnjtj1_EqZVzlpmp30ve2ashRVHaQQA8CjxeLDdhuzK84jZXD1ydejoJlxK1TWRBc4akXKoYdAn4M5sJtrneu3lQ2SsI-CsE0yr7Qs67nj9x2kJ9Kp1-SEbE3fZbQYH59jjrZUFYgfZXVa6cl2hVwtl4wG0aC30BlgVEeKTpRMXqam26_tC3lic6NuVNXFuH5AjJDHne0CiSDz3LbKa2ZJV98Tz1Kj-I24xFWU54OZMXvxT5JudF5qBXpN9stxtBFcWMxiaJea0pqmiU3hlIKH08PMz1mbxE0AqRdrdC3AHyMRGuuUEj8Ng</ns1:AuthToken>
			</ns1:Auth>
			<ns1:Packages>
				<ns1:MyApiPackageIn>
					<ns1:PackNumber>123456789</ns1:PackNumber>
					<ns1:PackProductType>SMARD</ns1:PackProductType>
					<ns1:Note>test</ns1:Note>
					<ns1:Recipient>
						<ns1:City>Hradec Králové</ns1:City>
						<ns1:Country>CZ</ns1:Country>
						<ns1:Email>j.doe@example.com</ns1:Email>
						<ns1:Name>John Doe</ns1:Name>
						<ns1:Phone>123456789</ns1:Phone>
						<ns1:Street>Hlavní 1</ns1:Street>
						<ns1:ZipCode>500 01</ns1:ZipCode>
					</ns1:Recipient>
					<ns1:SpecialDelivery>
						<ns1:ParcelShopCode>123456789</ns1:ParcelShopCode>
					</ns1:SpecialDelivery>
					<ns1:PaymentInfo>
						<ns1:BankAccount>123456789</ns1:BankAccount>
						<ns1:BankCode>0300</ns1:BankCode>
						<ns1:CodCurrency>CZK</ns1:CodCurrency>
						<ns1:CodPrice>100</ns1:CodPrice>
						<ns1:CodVarSym>123456789</ns1:CodVarSym>
						<ns1:InsurCurrency>CZK</ns1:InsurCurrency>
						<ns1:InsurPrice>100</ns1:InsurPrice>
						<ns1:SpecSymbol>123456789</ns1:SpecSymbol>
					</ns1:PaymentInfo>
					<ns1:PackagesExtNums>
						<ns1:MyApiPackageExtNum>
							<ns1:Code>B2CO</ns1:Code>
							<ns1:ExtNumber>123456789</ns1:ExtNumber>
						</ns1:MyApiPackageExtNum>
						<ns1:MyApiPackageExtNum>
							<ns1:Code>CUST</ns1:Code>
							<ns1:ExtNumber>123456789</ns1:ExtNumber>
						</ns1:MyApiPackageExtNum>
					</ns1:PackagesExtNums>
					<ns1:PackageServices>
						<ns1:MyApiPackageInServices>
							<ns1:SvcCode>COD</ns1:SvcCode>
						</ns1:MyApiPackageInServices>
					</ns1:PackageServices>
					<ns1:PackageFlags>
						<ns1:MyApiFlag>
							<ns1:Code>CL</ns1:Code>
							<ns1:Value>true</ns1:Value>
						</ns1:MyApiFlag>
					</ns1:PackageFlags>
					<ns1:PackageSet>
						<ns1:MastepackNumber>123456789</ns1:MastepackNumber>
						<ns1:PackageInSetNr>1</ns1:PackageInSetNr>
						<ns1:PackagesInSet>1</ns1:PackagesInSet>
					</ns1:PackageSet>
					<ns1:WeightedPackageInfo>
						<ns1:Weight>10.22</ns1:Weight>
					</ns1:WeightedPackageInfo>
				</ns1:MyApiPackageIn>
			</ns1:Packages>
		</ns1:CreatePackages>
	</ns0:Body>
</ns0:Envelope>